{
  "text":"Update Logs",
  "text1":"June 14, 2019",
  "text2":"April 25, 2019",
  "text5":"Bug fixes for basic application functionality;",
  "text6":"Wallet performance optimization;",
  "text7":"UI Display Optimization;",
  "text8":"Personalized icon fix for participant nodes.",
  "text9":"Official release of ELA Wallet;",
  "text10":"Download the latest version v 1.4.4",
  "text11":"July 22, 2019",
  "text12":"Fixed bugs.",
  "text13":"Optimized Supernode profit presentation.",
  "text17":"And added small change consolidation feature.",
  "text14":"Optimized general interface and application background.",
  "text15":"Optimized Supernode Election interface.",
  "text16":"Added “About ELA Wallet” page.",

  "text18":"August 16, 2019",
  "text19":"Optimized wallet startup speed;",
  "text20":"Fixed two bugs that can crash the app;",
  "text21":"Optimized system compatibility with older versions;",
  "text22":"Modified the translation wording for English version;",
  "text23":"Optimized UI interface details;",

  "text24":"October 9, 2019",
  "text25":" Bug fixes;",
  "text26":"iOS 13 app crash issues addressed and fixed.",
  "text27":"Note: Please back up your wallet before upgrading the wallet app.",
  "text28":"For iOS users, please upgrade the wallet app before upgrading your iOS. ",
  "text29":" If you have already upgraded to iOS 13, please uninstall the wallet app and reinstall the latest version.",

  "text30":"December 31, 2019",
  "text31":"This upgrade includes the following:",
  "text32":"1. Fixed all known issues",
  "text33":"2. Added CR Council election feature",
  "text34":"3. Optimized the DID Sidechain synchronization",
  "text35":"Notes:",
  "text36":"Please back up your wallet before upgrading to the new version. The election of CR Council members will be based on the participant's DID. Therefore, please make sure that the DID Sidechain is turned on before participating in the election.",
  "text37":"",

  "text38":"January 15, 2020",
  "text39":"This edition of ELA Wallet contain the following upgrades:",
  "text40":"1. Error-Fix for the QR code scans;",
  "text41":"2. Adjustment for transaction confirmation quantity status.",
  "text42":"Note:",
  "text43":"Please make sure to back up your wallet before upgrading the ELA Wallet.",
  "text44":"",

  "text45":"March 31 , 2020",
  "text46":"This edition of ELA Wallet contain the following upgrades:",
  "text47":"1. Adds the function of creating DID, which supports adding personal credentials",
  "text48":"2. Candidates for CR members can issue relevant election related information through their personal credentials",
  "text49":"3. Supports the binding of Elastos DID and CR website account and login to CR account by scanning QR code",
  "text50":"4. Optimizes wallet start-up speed",
  "text51":"5. Adds \"node connection setting\" function",
  "text52":"Notes:",
  "text53":"-CR member candidates need to create DID, add avatar information, personal profile and other election related information to personal credentials, and publish all election related information through \"Update DID Information\";",
  "text54":"-After CR council candidates create Elastos DID, they need to complete the binding with DID through \"Update Registration Information\".",
  "text55":"-Please back up your wallet before you perform the upgrading.",
  
  "text56":"June 5 , 2020",
  "text57":"This edition of ELA Wallet contain the following upgrades:",
  "text58":"1. Addition of CR Council function, enabling users to view council members and their public information;",
  "text59":"2. Addition of CR Proposal function, enabling users to view Proposals, browse their contents by category, and vote on the Proposals;",
  "text60":"3. Support for CR website DID binding, login, signing, voting, Proposal processes, and other functions;",
  "text61":"4. Addition of the vote revision function, enabling users to quickly add and remove candidates selected to their candidate lists.",
  "text62":"Notes:",
  "text63":"-After the election period, CR Council member election participation will be temporarily closed, and the election management function will contain the CR Council interface. Unelected candidates can use the election management function to retrieve their ELA deposits.",
  "text64":"-Each CR Council member must use the wallet corresponding to his, her, or their organization’s candidate DID in order to perform duties.",
  "text65":"-The QR codes provided on the CR website can be scanned using the scanning function on the upper righthand corner of the wallet home screen.",

  "text66":"June 30 , 2020",
  "text67":"This edition of ELA Wallet contain the following upgrades:",
  "text68":"1. Optimize proposal processing flow",
  "text69":"2. Add the impeachment function of the committee members to vote for impeachment of dissatisfied committee members",
  "text70":"3. Add the function of resetting data to re-synchronize the synchronized data while keeping the wallet",
  "text71":"4. Fix bugs",
  "text72":"Notes:",
  "text73":"-Please back up your wallet before you perform the upgrading."
}
