export default {
    '0001' : '筹委会',
    '0002' : '档案列表',
    '0003' : '草案',
    
    list : {
        '1' : '亦来云社区章程',
        '2' : '亦来云社区共治委员会成立文件',
        '3' : '亦来云社区投票规则',
        '4' : '亦来云社区共治委员会利益冲突政策',
        '5' : '亦来云社区共治委员会提案表决规则'
    },
    desc : {
        '1' : `
            亦来云社区章程（“章程”）的目的是为亦来云社区提供一份文件，概述亦来云的价值观和愿景。         
        `,
        '2' : `
            根据“亦来云社区章程”（“章程”）要求，建立共治委员会。 
        `,
        '3' : `
            Elastos社区投票规则（“规则”）的目的是规范Elastos社区的治理。
       `,
        '4' : `
            亦来云社区共治委员会利益冲突政策的目的是为亦来云社区共治委员会成员制定明确的利益冲突规则。
        `,
        '5' : `
            该提案和表决规则由社区共治委员会（以下简称CRC）讨论和批准，并由秘书处监督。
        `
    },
    article : {
        '1' : `
         
        <strong> 1 过渡期</strong>
         
        <ol>
            <li>这是本文档的草案版。</li>
            <li>亦来云社区章程（以下简称“章程”）和其他创始文件旨在规定亦来云社区成员的权利和关系。</li>
            <li>在Elastos成立一周年（2018年8月25日）和Elastos成立两周年（2019年8月25日）的过渡期间，创始文件的条款将不断修订。</li>
            <li>共治筹备委员会（“筹委会”）将由Elastos基金会推荐代表管理，并将不断制拟定、完善章程和投票规则，以反映共治委员会治理的实际需要和经验。</li>
            <li>在过渡期结束时，将完全过渡到由共治委员会进行社区治理。</li>
            <li>在过渡期末，本文件的修订将遵循社区投票程序，该程序应在Elastos社区投票规则文件中定义。</li>
        </ol>
        
        <strong> 2  目的</strong>
          亦来云社区章程的目的是：
        <ol>
            <li>为亦来云社区提供一份文件，概述亦来云的价值观和愿景。</li>
            <li>为社区参与亦来云生态系统治理提供基础。</li>
            <li>确保亦来云社区治理系统的结构适合并响应亦来云社区的需求。</li>
        </ol>
         
        <strong> 3 愿景</strong>
         
        亦来云正在创造一个安全可靠的未来互联网。这一财富互联网将迎来创新经济的新时代，其灵感来自智能网的安全性，数字资产和数据的所有权和交易，以及区块链技术和分散式应用的互操作性和可扩展性。
        <strong> 4 价值观</strong>
         
        亦来云社区的价值观是
 
        <ol>
            <li>创新经济；</li>
            <li>创造数字财富；</li>
            <li>社区治理；</li>
            <li>透明和共享。</li>
        </ol>
         
        <strong> 5 社区治理</strong>
         
        <ol>
            <li>亦来云是由亦来云基金会创立的开源平台。随着项目的进展和社区的发展，亦来云基金会逐渐将社区运营转交社区共治委员会。</li>
            <li>在Elastos Genesis Block（亦来云创始区块）创造的33,000,000枚ELA代币中，亦来云基金会选择投入16,500,000枚代币用于开发亦来云生态系统。这些代币将用作对亦来云生态系统捐款的奖励，其分配将由社区本身通过本章程第6条所述的社区共治委员会决定。</li>
            <li>每年在最初的33,000,000枚ELA代币基础上增发4％，以确保代币供应通胀的健康率，激励网络支持，并为项目提供资金。在这些增发的代币中，30％将作为管理开发亦来云生态系统的额外资产提供给社区共治。</li>
            <li>由亦来云基金会管理的数字资产仅限于前期募集的代币，以及白皮书中分配给亦来云基金会的部分.</li>
        </ol>
         
        <strong> 6 共治委员会</strong>
        <ol>
            <li>共治委员会是决定如何管理用于亦来云生态系统发展的资金的组织。</li>
            <li>共治委员会由两个单独的文件管理：亦来云社区共治委员会成立文件和亦来云社区共治委员会利益冲突政策。</li>
            <li>社区投票将由一份单独的文件管理，即亦来云社区投票规则，将在过渡期结束时发布。</li>
        </ol>
        
        <strong> 7 社区投票</strong>
         
        虽然亦来云社区共治筹委会目前由来自亦来云基金会推荐的3名代表组成，但社区共治委员会应由过渡期完成后由亦来云社区投票选出的委员组成。将有具体规则规定社区共治委员会委员选举，章程修改以及对提案投票的要求。
        <strong> 8 修改章程</strong>
        
        修改章程时，应遵循亦来云社区投票规则中的程序，同时满足以下标准：
        <ol>
            <li>ELA在投票截止日期时参与投票的 ELA 占流通ELA的30％以上；</li>
            <li>及同意票数超过参与投票 ELA 的66.67％ 。</li>
        </ol>

        <strong> 9 其他</strong>
        
        <b>共识</b> 亦来云使用混合POW / DPOS共识模型。4％的年度通货膨胀分配如下：35％奖励POW矿工，35％奖励DPoS机制，30％奖励社区共治作为开发亦来云生态系统的资金。
        <br/>
        
        <b>共治委员会</b> 共治委员会由亦来云社区投票产生。
        <br/>
        
        <b>创始文件</b> 其他创始文件包括亦来云社区投票规则、亦来云社区共治委员会成立文件和亦来云社区共治委员会利益冲突政策。
        <br/>
        
        <b>创新经济</b> 亦来云的创新经济指的是通过区块链认证授权个人拥有自己的数据和代码以允许创造新财富 - 财富互联网的概念。
        <br/>
        
        <b>过渡期</b> 亦来云的第一个和第二个周年纪念日（2018年8月25日和2019年8月25日）之间的时间段，在此期间，社区共治筹委会的治理权将缓慢而谨慎地过渡到社区投票选出的共治委员会。
        <br/>
        
        <b>智能万维网</b> 智能万维网是一种更安全的互联网，应用程序无法直接访问互联网，所有通信都由Elastos操作系统和Elastos Carrier控制。
        <br/>
        `,

        '2' : `
        <center>第一章	 总则</center>
        <strong> 1 过渡期</strong>
         
        <ol>
            <li>这是本文档的草案版。</li>
            <li>亦来云社区章程（以下简称“章程”）和其他创始文件旨在规定亦来云社区成员的权利和关系。</li>
            <li>在Elastos成立一周年（2018年8月25日）和Elastos成立两周年（2019年8月25日）的过渡期间，创始文件的条款将不断修订。</li>
            <li>共治筹备委员会（“筹委会”）将由Elastos基金会推荐代表管理，并将不断制拟定、完善章程和投票规则，以反映共治委员会治理的实际需要和经验。</li>
            <li>在过渡期结束时，将完全过渡到由共治委员会进行社区治理。</li>
            <li>在过渡期末，本文件的修订将遵循社区投票程序，该程序应在Elastos社区投票规则文件中定义。</li>
        </ol>
      
        
        <strong>2 目的</strong>
        社区共治委员会成立文件的目的是
        <ol>
            <li>根据章程第6条要求，建立共治委员会；</li>
            <li>描述共治委员会结构，其成员的资质以及其成员的责任；</li>
            <li>设立共治委员会秘书处（以下简称“秘书处”）；</li>
            <li>随附的共治委员会利益冲突政策，该政策提供了对共治委员会成员权力的制衡制度；</li>
            <li>鼓励有经验、有能力的人参与选举共治委员会委员。</li>
        </ol>
        
        <strong>3 选举</strong>
        Elastos社区共治委员会是通过社区投票选出的。投票过程将在Elastos社区投票规则中定义。
        
        <center>第二章	结构和程序</center>
        
        <strong>4 结构</strong>
        <ol>
            <li>共治委员会有七名委员和五名候补委员。</li>
            <li>每届任期一年。</li>
            <li>共治委员会委员可以连选连任。</li>
            <li>如果在任期结束前没有进行换届选举，则共治委员会成员应继续承担其作为委员会成员的责任，直至选出新的共治委员会委员。</li>
        </ol>

        <strong>5 参选共治委员会委员、候补委员</strong>

        在参选共治委员会委员或候补委员时，秘书处应公布候选人名单并披露候选人信息，包括但不限于：
        <ol>
            <li>个人信息，如教育背景，工作经验，兼职等；</li>
            <li>对Elastos社区的贡献；</li>
            <li>竞选该职位的陈述；</li>
            <li>ELA锁仓数量（包括支持候选人的社区成员的ELA锁仓数量）；</li>
            <li>与共治委员会其他成员的关系（如果有的话）。</li>
        </ol>
        
        <strong>6 辞职</strong>

        共治委员会委员和候补委员可在任期结束前以书面形式向共治委员会提交辞呈。

        <strong>7 职位空缺</strong>

        共治委员会的空缺应由一名候补委员填补该任期的剩余时间。如果没有剩余的候补成员，则应启动新的选举投票。

        <center>第三章 资格和责任</center>

        <strong>8 资格</strong>
        共治委员会委员和候补委员的资格包括但不限于：
        <ol>
            <li>为Elastos社区做出贡献，包括但不限于稳定地保持完整节点，提供资源以支持重大活动等；</li>
            <li>获得锁仓10,000 ELA 的选票支持；</li>
            <li>自愿参选共治委员会委员，并有时间及精力议事。</li>
        </ol>

        <strong>9 权力</strong>
        共治委员会应就以下事项作出决议：       
        <ol>
            <li>年度预算及其实施；</li>
            <li>适用于第10节中定义的持续支出或单一支出的申请；</li>
            <li>审查和评估整个社区运营，并相应地提供奖励；</li>
            <li>决定商业计划和投资计划；</li>
            <li>共治委员会成员报酬；</li>
            <li>其他需要社区来解决事项。</li>
        </ol>
        
        <strong>10 支出 </strong>
        <ol>
            <li>持续支出定义为年度累计支出不得超过社区管理资产的10％ 。</li>
            <li>单一支出定义为单笔项目支出不超过社区管理资产的1％ 。</li>
            <li>不允许持续支出超过共治委员会委员代表社区管理的总资产的10％ 。</li>
            <li>如果社区管理资产小于400万ELA，则持续支出申请必须少于社区管理资产的1％，而单一支出申请则须小于0.5％ 。</li>
        </ol>
        
        <strong>11 报酬</strong>
        共治委员会成员的报酬在过渡期结束时确定。
        <center>第四章 共治委员会秘书处</center>

        <strong>12 秘书处的职责</strong>

        共治委员会秘书处负责处理共治委员会的日常事务。秘书处的职责包括：
        <ol>
            <li>召集共治委员会会议；</li>
            <li>监督共治委员会决议的执行；</li>
            <li>披露共治委员会的提案资料；</li>
            <li>确保共治委员会充分理解重要文件。</li>
        </ol>
        
        <strong>13 秘书处的结构</strong>
        <ol>
            <li>由共治委员会聘任秘书处成员；</li>
            <li>成员任期为1年；</li>
            <li>秘书处成员可以续聘。</li>
        </ol>
        
        <center>第五章 管理准则</center>
        <strong>14 价值观</strong>

        共治委员会和秘书处的成员应遵守以下价值观：
        <ol>
            <li>廉正；</li>
            <li>专业；</li>
            <li>透明；</li>
            <li>问责制。</li>
        </ol>

        <strong>15 目标</strong>
        共治委员会和秘书处的成员应始终确保其决定以下列最终目标为指导：
        <ol>
            <li>推进Elastos生态系统；</li>
            <li>反映Elastos社区的意愿。</li>
        </ol>
    
        `,

        '3' : `
        <center>第一章	</center>

        <strong> 1 过渡期</strong>
        <ol>
            <li>这是本文档的草案版。</li>
            <li>亦来云社区章程（以下简称“章程”）和其他创始文件旨在规定亦来云社区成员的权利和关系。</li>
            <li>在Elastos成立一周年（2018年8月25日）和Elastos成立两周年（2019年8月25日）的过渡期间，创始文件的条款将不断修订。</li>
            <li>共治筹备委员会（“筹委会”）将由Elastos基金会推荐代表管理，并将不断制拟定、完善章程和投票规则，以反映共治委员会治理的实际需要和经验。</li>
            <li>在过渡期结束时，将完全过渡到由共治委员会进行社区治理。</li>
            <li>在过渡期末，本文件的修订将遵循社区投票程序，该程序应在Elastos社区投票规则文件中定义。</li>
        </ol>

        <strong>2 目标</strong>
        亦来云社区投票规则（以下简称“投票规则”）的目的是：
        <ol>
            <li>规范Elastos社区的治理；</li>
            <li>按照亦来云社区章程第5条的要求，履行社区参与的任务；</li>
            <li>确保以合理和一致的规则进行社区投票；</li>
            <li>确保社区管理资产的治理有益于整个Elastos生态系统。</li>
        </ol>
        
        
        <strong>3 管理</strong>
        整个投票过程在Elastos Blockchain上进行，并向社区开放。      
        <center>第二章 	社区建议和意见</center>

        <strong>4 社区建议</strong>
        制定社区成员建议和意见的过程应在过渡期间结束时确定。

        <center>第三章 提案</center>
        <strong>5 费用</strong>
        可能会有与提出提案相关的ELA费用，但这将在过渡期结束时最终确定。
        <strong>6 内容</strong>
        提案的内容应在过渡期结束时确定。
        <strong>7 提案程序</strong>
        提案由共治委员会发起，同步公开、透明。
      
        <center>第四章 投票	</center>

        <strong>8 投票类型 </strong>
        <ol>
            <li>有四种不同类型的社区投票：</li>
            <li>选举共治委员会委员；</li>
            <li>弹劾；</li>
            <li>普通提案；</li>
            <li>修改创始文件（章程、共治委员会成立文件、社区投票规则、共治委员会利益冲突政策）。</li>
        </ol>

        <strong>9 投票程序</strong>
        <ol>
            <li>共治委员会的选举程序：在现任委员会届满30天之前，秘书处将发起选举通知。</li>
            <li>弹劾：从社区投票产生共治委员会委员开始，弹劾程序自动启动。</li>
            <li>
            普通提案和创始文件修正案表决程序如下:
            <ul>
                <li>(a) 提案首先由共治委员会投票;</li>
                <li>(b) 在共治委员会投票简单多数原则通过后，社区将在公示期内投票。</li>
            </ul>
            </li>
        </ol>
        
        
        <strong>10 投票原则</strong>
        <ol>
            <li>一个ELA代表一票。</li>
            <li>社区成员可以投票支持提案，反对提案或弃权。</li>
            <li>表决应通过Elastos钱包或秘书处通知的其他方式进行。</li>
            <li>在公示期间，如果社区投票没有达到否定普通提案的标准，普通提案将自动生效。</li>
            <li>参与表决的相应ELA应保持锁定状态，直至投票截止日期为止。</li>
            <li>选举共治委员会委员时采用累计投票制。该过程在本文件的第11（1）节中描述。</li>
            <li>未流通 ELA 不具有表决权，也不计入表决基数。未流通 ELA 指生态建设未投出部分、亦来云( Elastos )基金会 ELA 帐户余额等未转至生态合作项目方帐户或自然人帐户的 ELA。</li>
        </ol>
        

        <center>第五章 决议 </center>
        <strong>11  投票门槛</strong>

        <ol>
            <li>
            选举共治委员会委员基于以下规则：
            <ul>
                <li>(1) 新一届共治委员会委员和候补委员的选举使用累积投票制。在累积投票中，参加投票的1 ELA 所代表的投票数应乘以应选共治委员会委员、候选委员人数之和。社区成员根据意愿在候选人中投票，包括为单个候选人分配多于一票。</li>
                <li>(2) 参加投票的ELA数应在投票截止日期时占流通ELA的20％以上，并且按照每个人获得的总票数从高到低当选。</li>
            </ul>
            </li>
            <li>弹劾生效的门槛标准，是支持弹劾达到占流通 ELA 20％以上的票数。</li>
            <li>
            否决共治委员会决议的门槛标准:
            <ul>
                <li>(1) 参与投票的 ELA 占流通 ELA 的20％以上；</li>
                <li>(2) 普通提案的反对票超过50％ 。</li>
            </ul>
            </li>
            <li>修改章程的门槛标准见“章程”第8部分。</li>
        </ol>

        <center>第六章 附则</center>
        <strong>12 其他</strong>
        <ol>
            <li>如果这些规则与社区“章程”所确立的价值观相冲突，则以“章程”为准。 共治委员会的首次选举将在过渡期结束时举行。</li>
        </ol>
        
        `,

        '4' : `
        <center> 第一章	 总则</center>
        <strong> 1 过渡期</strong>
         
        <ol>
            <li>这是本文档的草案版。</li>
            <li>亦来云社区章程（以下简称“章程”）和其他创始文件旨在规定亦来云社区成员的权利和关系。</li>
            <li>在Elastos成立一周年（2018年8月25日）和Elastos成立两周年（2019年8月25日）的过渡期间，创始文件的条款将不断修订。</li>
            <li>共治筹备委员会（“筹委会”）将由Elastos基金会推荐代表管理，并将不断制拟定、完善章程和投票规则，以反映共治委员会治理的实际需要和经验。</li>
            <li>在过渡期结束时，将完全过渡到由共治委员会进行社区治理。</li>
            <li>在过渡期末，本文件的修订将遵循社区投票程序，该程序应在Elastos社区投票规则文件中定义。</li>
        </ol>
        
        <strong>2 目标</strong>
        亦来云社区共治委员会利益冲突政策（从下简称“利益冲突政策”）的目的是为了：
        <ol>
            <li>为亦来云社区共治委员会成员制定明确的利益冲突规则；</li>
            <li>尽量减少私人利益与亦来云社区共治委员会成员的Elastos治理职责之间发生冲突的可能性；</li>
            <li>为亦来云社区共治委员会成员提供公开披露其私人利益的机制；</li>
            <li>向亦来云社区提供机制，在披露不充分或明显利益冲突的情况下向亦来云社区共治委员会成员提出投诉；</li>
            <li>为亦来云社区出现这些冲突提供解决方案；</li>
            <li>鼓励有经验和有能力的人任职。</li>
        </ol>
        
        <strong>3 利益冲突 </strong>
        就本政策而言，亦来云社区共治委员会成员在行使权力，职责或职能以提供机会进一步扩展其私人利益或其亲属朋友的利益进一步不当行为时，会产生利益冲突。
        <center>第二章	 亦来云社区共治委员会委员的职责</center>

        <strong>4 基本职责</strong>
        <ol>
            <li>每个亦来云社区共治委员会成员都应作出努力，以防止亦来云社区共治委员会成员以其私人事务陷入利益冲突。</li>
            <li>如果出现冲突，每个亦来云社区共治委员会成员都有责任披露。本职责在本文件第12节中有详细描述。</li>
            <li>亦来云社区共治委员会成员可能存在利益冲突，重要的是披露这些冲突。隐藏这些冲突是不可接受的。</li>
            <li>如果有亦来云社区共治委员会成员未披露利益冲突，则应视为对该亦来云社区共治委员会成员进行投诉的理由，以及该亦来云社区共治委员会成员可能会被亦来云社区共治委员会撤职。</li>
        </ol>
        
        <strong>5 决策</strong>
        如果亦来云社区共治委员会成员在作出决定时知道或合理地知道，他或她不应作出决定或参与作出与行使官方权力，职责或职能有关的决定会有利益冲突。
        <strong>6 优惠待遇</strong> 
        任何亦来云社区共治委员会成员在行使权力，职责或职能时，不得以任何个人或组织的名义给予个人或组织优惠待遇。
        <strong>7 内幕消息</strong>
        任何亦来云社区共治委员会成员均不得使用其作为亦来云社区共治委员会成员的身份获得的信息，以及公众无法获得的信息，以促进或寻求进一步推动亦来云社区共治委员会成员的私人利益或亦来云社区共治委员会成员的亲属朋友，或进一步促进他人的私人利益。
        <strong>8 影响</strong>
        任何亦来云社区共治委员会成员均不得利用其作为亦来云社区共治委员会成员的身份，试图影响他人的决定，以促进他们自己的私人利益或亦来云社区共治委员会成员的亲属朋友的利益，或不正当地促进另一人的私人利益。
        <strong>9 就业机会</strong>
        任何亦来云社区共治委员会成员均不得通过利用亦来云社区共治委员会的权力，职责或职能计划或提供就业机会。
        <strong>10 利益</strong>
        任何亦来云社区共治委员会成员或其家庭成员均不得接受任何可能被视为影响亦来云社区共治委员会成员行使权力的礼物或其他利益。
        <strong>11 撤权的责任</strong>
        亦来云社区共治委员会成员应就任何与他或她有利益冲突的事项进行任何讨论，决定，辩论或投票。
        <strong>12 披露的义务</strong>
        每个亦来云社区共治委员会成员都有责任披露可能与亦来云社区和Elastos社区利益相冲突的个人行为。这些个人利益可能包括但不限于：
        <ol>
        <li>亦来云社区共治委员会成员感兴趣的其他区块链项目；</li>
        <li>亦来云社区共治委员会成员参与的其他形式的就业或商业活动；</li>
        <li>亦来云社区共治委员会成员收到的任何其他形式的收入。</li>
        </ol>
        <center>第三章 检查和平衡</center>
       <strong> 13 投诉</strong>
        如果社区成员认为亦来云社区共治委员会成员的利益与他们作为亦来云社区共治委员会成员的责任相冲突，并且该社区成员认为其未充分披露或披露未能充分缓解冲突，社区成员可以对该亦来云社区共治委员会成员提出投诉。
        <strong>14 举报</strong>
        如果发生投诉，委员会秘书处应在投诉举报网页上披露投诉。
        <strong>15 弹劾</strong>
        从共治委员会产生开始，委员或候补委员的弹劾程序将自动激活。社区成员可以随时支持弹劾程序。弹劾共治委员会委员的决议应遵循Elastos社区投票规则。
        <strong>16 空缺</strong>
        移除亦来云社区共治委员会成员所产生的任何空缺应由候补成员填补。
        `,

        '5' : `

        <p>
        1. 该提案和表决规则由社区共治委员会（以下简称CRC）讨论和批准，并由秘书处监督.
        </p>

        <p>
        2. CRC的推荐语言是英语，如果语言之间存在冲突，则以英语为准.
        </p>

        <b>3. CRC 会议</b>
        <table>
            <tr>
                <td>会议时间: </td>
                <td>每周四13:00 GMT + 8.</td>
            </tr>
            <tr>
                <td>会议形式: </td>
                <td>Zoom，zoom会议邀请链接</td>
            </tr>
            <tr>
                <td>会议时间: </td>
                <td>1 小时 </td>
            </tr>
            <tr>
                <td>会议议程: </td>
                <td>CRC以提案的形式提交. </td>
            </tr>
            <tr>
                <td>会议纪要: </td>
                <td>由秘书处记录并发布在社区共治委员会网站上
                </td>
            </tr>
        </table>

        <b>4. 提案</b>
        <ul style="padding-left:40px;">
            <li>a. 所有提案均向社群开放，并在CRC网站上发布
            </li>
            <li>b. 只有CRC成员和秘书处才有权提出提案
            </li>
            <li>c. 只有CRC成员才能对提案进行投票.
            </li>
            <li>d. 提案的生命周期如下:
            <img src="/assets/images/council/img_1.png" style="display:block;margin: 5px 0 30px 0;"/>
            </li>
            <li>e. 在投票截止日期前获得2个“同意”时，提案自动从“建议”更改为“自动激活”. 
            </li>
            <li>f. 在投票截止日期前获得2个“异议”时，提案将自动从“建议”更改为“被拒绝” 
            </li>
            <li>g. 在提案截止日期前未能获得2个“同意”或2个“异议”时，提案将自动从“建议”更改为“推迟”. 
            </li>
            <li>h. 当提案执行并完成时，秘书处将提案从“自动激活”更改为“结束”.
            </li>
            <li>i. 一个“自动激活”提案发布到社区，社区投票期为72小时.
            </li>
            <li>j. “被拒绝”提案不能在1周内重新提交
            </li>
        
        </ul>
        <b>5. 投票规则</b>
        <ul style="padding-left:40px;">
            <li>a. 每个CRC成员都有1票且只有1票</li>
            <li>b. 投票选项分为同意，反对和弃权</li>
            <li>c. 没有否决权 </li>
            <li>d. 提出提案后，投票期开始并持续96小时。 在投票期间，CRC成员可以改变他们的投票. </li>
            <li>e. 如果CRC成员未能在截止日期前投票，他的投票将被视为弃权</li>
        </ul>

        
        `
    }
    
}
